{
  "architectures": [
    "WisentLlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 128000,
  "eos_token_id": 128001,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 131072,
  "model_type": "wisent_llama",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": {
    "factor": 8.0,
    "high_freq_factor": 4.0,
    "low_freq_factor": 1.0,
    "original_max_position_embeddings": 8192,
    "rope_type": "llama3"
  },
  "rope_theta": 500000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.44.0",
  "use_cache": true,
  "vocab_size": 128256,
  "auto_map": {
    "AutoConfig": "modeling_wisent_llama.WisentLlamaConfig",
    "AutoModelForCausalLM": "modeling_wisent_llama.WisentLlamaForCausalLM"
  },
  "trust_remote_code": true,
  "_name_or_path": "meta-llama/Llama-3.1-8B-Instruct",
  "wisent_enabled": true,
  "wisent_threshold": 0.5,
  "wisent_layers": [15],
  "wisent_use_classifier": true,
  "wisent_classifier_path": "wisent_data/classifier.pkl",
  "wisent_classifier_threshold": 0.5,
  "wisent_early_termination": true,
  "wisent_termination_message": "Sorry, this response was blocked due to potentially harmful content.",
  "wisent_categories": ["harmful", "hallucination"]
} 