{
  "architectures": [
    "WisentQwen2ForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "hidden_act": "silu",
  "hidden_size": 3584,
  "initializer_range": 0.02,
  "intermediate_size": 18944,
  "max_position_embeddings": 4096,
  "max_window_layers": 28,
  "model_type": "wisent_qwen2",
  "num_attention_heads": 28,
  "num_hidden_layers": 28,
  "num_key_value_heads": 4,
  "rms_norm_eps": 1e-06,
  "rope_theta": 10000.0,
  "sliding_window": 4096,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.43.1",
  "_name_or_path": "Qwen/Qwen2.5-Math-7B-Instruct",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 152064,
  "auto_map": {
    "AutoConfig": "modeling_wisent_qwen.WisentQwen2Config",
    "AutoModelForCausalLM": "modeling_wisent_qwen.WisentQwen2ForCausalLM"
  },
  "caa_enabled": true,
  "caa_layer_id": 23,
  "caa_alpha": 0.45,
  "steering_method": "caa",
  "wisent_optimization": {
    "best_value": 0.774,
    "commit_hash": "66e93ff82cd353f57db454fbe87a8fa311063d27",
    "timestamp": "20250822_114532",
    "dataset": "hendrycks_math",
    "random_seed": 42
  },
  "steering_vector_path": "./vectors/hendrycks_math/steering_vector.safetensors"
}
